#ifndef STRING_H_
#define STRING_H_

#include <iostream>
#include <cstring>
#include <fstream>

/// Header file, който съдържа декларацията на клас String.

/**
 * Собствена имплементация на клас String, необходима за осъществяването на проекта.
 * В класа могат да се видят конструктор по подразбиране, конструктор с параметри, конструктор за копиране, деструктор, 
 * предефиниране на някои оператори и няколко помощни метода.
*/
class String
{
private:
    char* string; ///< Член-данна от тип char*, на която заделям динамична памет при реализацията на методите.

    void init(const char*); ///< Метод за инициализиране на char* string.

public:
    int size() const; ///< Метод, който връща размера на масива от тип char, за който е извикан.
    char* getString(); ///< Getter, който се използва за достъпване на private член-данната string.
    String concat(const String&); ///< Метод за сливане/залепяне на два масива.

    String(); ///< Конструктор по подразбиране.
    String(const char*); ///< Конструктор с параметър от тип const char*.
    String(const String&); ///< Конструктор за копиране.
    ~String(); ///< Деструктор.

    String operator+(const char); ///< Оператор за събиране/залепяне на масив и символ, при което резултатният масив е различен от първите два.
    String& operator+=(const char); ///< Оператор за събиране/залепяне на масив и символ, при което резултатният масив се запаметява на мястото на първия.
    String& operator+=(const String&); ///< Оператор за събиране/залепяне на два масива, при което резултатният масив се запаметява на мястото на първия. 
    String& operator=(const String&); ///< Оператор = за присвояване на стойността на един масив на друг масив.
    String operator+(const String&); ///< Оператор за събиране/залепяне на два масива, при което резултатният масив е различен от първите два.
    bool operator==(String&); ///< Оператор, който проверява дали два масива са еднакви.
    bool operator==(const char*); ///< Оператор, който проверява дали два масива - единия от const char*, а другия от тип char* са еднакви.
    char& operator[](unsigned int); ///< Оператор за индексиране на елементите на масив.
};

std::ostream& operator<< (std::ostream&, String); ///< Оператор за изходен поток. Извежда даден масив на екрана.
std::istream& operator>> (std::istream&, String&); ///< Оператор за входен поток. Въвежда даден масив в паметта.

#endif